AccumulationRegisters/АР_РасчетыПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_РасчетыПоДоговорам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ПроведениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СФакторинговойКомпанией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СТранспортнойКомпанией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаемПолученный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/АР_ГруппыУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ГруппыУслуг</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/АР_РасчетыПоДоговорамНовый/Ext/Module.bsl
Процедура АР_РасчетыПоДоговорамЗаписьПриЗаписи(Источник, Отказ) Экспорт
	
	// + NAI Becar Комментирование Смирнов А.А. от 17.05.2019 15:51
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ОперацияБух") Тогда
		Если Источник.Содержание = "ввод долгов по ИК Переведеновский" или Источник.Комментарий = "АР_РасчетыПоДоговорамОстатки" 
			или Источник.Номер = "БЭ00-000157" Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	// - NAI Becar Комментирование Смирнов А.А. от 17.05.2019 15:51
	
	Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
	
	Если Источник.Движения.АР_РасчетыПоДоговорам.Количество() > 0 Тогда // Очищаем то что ввели руками или было введено ранее
		
		Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
		Источник.Движения.АР_РасчетыПоДоговорам.Записать();
		
	КонецЕсли;
	
	//Если Источник.ПометкаУдаления Или Источник.Дата < Дата('20190101') Тогда Возврат; КонецЕсли; // Удаленные и до 2019 не обрабатываем
	Если Источник.ПометкаУдаления Или Источник.Дата < Дата('20200101') Тогда Возврат; КонецЕсли; // Удаленные и до 2020 не обрабатываем
	
	Для Каждого Стр Из Источник.Движения.Хозрасчетный Цикл
		
		Если Стр.Сумма = 0 Тогда Продолжить; КонецЕсли;
		
		КодДт = Стр.СчетДт.Код;
		КодКт = Стр.СчетКт.Код;
		
		ЗДА_Дт = ПолучитьЗДА(Стр.СубконтоДт.Договоры, КодДт);
		ЗДА_Кт = ПолучитьЗДА(Стр.СубконтоКт.Договоры, КодКт);
		
		// ДТ
		Если (КодДт = "62.01" ИЛИ КодДт = "76.06" ИЛИ КодДт = "76.09") И ЗДА_Дт <> Неопределено Тогда
			
			ДокументРасчета = ПолучитьДокументРасчета(Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами);
			
			Если ДокументРасчета <> Неопределено Тогда
				
				Данные = Новый Структура;
				Данные.Вставить("ДоговорКонтрагента", Стр.СубконтоДт.Договоры);
				Данные.Вставить("ДокументРасчета", Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами);
				Данные.Вставить("Сумма", Стр.Сумма);
				
				ПровестиДолг(Источник, Данные);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Кт
		Если (КодКт = "62.01" Или КодКт = "76.06" Или КодКт = "76.09") И ЗДА_Кт <> Неопределено Тогда 
			
			ДокументРасчета = ПолучитьДокументРасчета(Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами);
			
			Если ДокументРасчета <> Неопределено Тогда
			
				Данные = Новый Структура;
				Данные.Вставить("ДоговорКонтрагента", Стр.СубконтоКт.Договоры);
				Данные.Вставить("ДокументРасчета", Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами);
				Данные.Вставить("Сумма", Стр.Сумма);
				ПровестиОплату(Источник, Данные);  
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Источник.Движения.АР_РасчетыПоДоговорам.Количество() > 0 Тогда
	
		Источник.Движения.АР_РасчетыПоДоговорам.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура АР_РасчетыПоДоговорамНовыйОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Если Источник.Дата < Дата('20190101') Тогда
	Если Источник.Дата < Дата('20200101') Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Источник.Движения.Найти("Хозрасчетный") = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Источник.Движения.Найти("АР_РасчетыПоДоговорам") = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Источник.Движения.АР_РасчетыПоДоговорам.Прочитать();
	
	Если Источник.Движения.АР_РасчетыПоДоговорам.Количество() > 0 Тогда // Очищаем то что ввели руками или было введено ранее
		
		Источник.Движения.АР_РасчетыПоДоговорам.Очистить();
		Источник.Движения.АР_РасчетыПоДоговорам.Записать();
		
	КонецЕсли;
	
	Если Источник.Движения.Хозрасчетный.Количество() = 0 Тогда
		
		Источник.Движения.Хозрасчетный.Прочитать();
		
	КонецЕсли;
	
	Если Источник.Движения.Хозрасчетный.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("Тип");
	Табл.Колонки.Добавить("ДоговорКонтрагента");
	Табл.Колонки.Добавить("ДокументРасчета");
	Табл.Колонки.Добавить("Сумма");
	
	Для Каждого Стр Из Источник.Движения.Хозрасчетный Цикл
		
		Если Стр.Сумма = 0 Тогда Продолжить; КонецЕсли;
		
		КодДт = Стр.СчетДт.Код;
		КодКт = Стр.СчетКт.Код;
		
		ЗДА_Дт = ПолучитьЗДА(Стр.СубконтоДт.Договоры, КодДт);
		ЗДА_Кт = ПолучитьЗДА(Стр.СубконтоКт.Договоры, КодКт);
		
		// ДТ
		Если (КодДт = "62.01" ИЛИ КодДт = "76.06" ИЛИ КодДт = "76.09") И ЗДА_Дт <> Неопределено Тогда
			
			ДокументРасчета = ПолучитьДокументРасчета(Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами);
			
			Если ДокументРасчета <> Неопределено Тогда
			
				Нов						=	Табл.Добавить();
				Нов.Тип					=	"Реализация";
				Нов.ДоговорКонтрагента	=	Стр.СубконтоДт.Договоры;
				Нов.ДокументРасчета		=	Стр.СубконтоДт.ДокументыРасчетовСКонтрагентами;
				Нов.Сумма				=	Стр.Сумма;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Кт
		Если (КодКт = "62.01" Или КодКт = "76.06"  ИЛИ КодКт = "76.09") И ЗДА_Кт <> Неопределено Тогда 
			
			ДокументРасчета = ПолучитьДокументРасчета(Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами);
			
			Если ДокументРасчета <> Неопределено Тогда
			
				Нов						=	Табл.Добавить();
				Нов.Тип					=	"Оплата";
				Нов.ДоговорКонтрагента	=	Стр.СубконтоКт.Договоры;
				Нов.ДокументРасчета		=	Стр.СубконтоКт.ДокументыРасчетовСКонтрагентами;
				Нов.Сумма				=	Стр.Сумма;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Табл.Свернуть("Тип, ДоговорКонтрагента, ДокументРасчета", "Сумма");
	Табл.Сортировать("Тип Убыв");
	
	Для Каждого Стр Из Табл Цикл
		
		Если Стр.Тип = "Реализация" Тогда 
			
			// При корректировке в меньшую сторону не возвращаем данные в план
			Если Стр.Сумма > 0 
				И ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
				И ТипЗнч(Стр.ДокументРасчета) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
					СторнироватьПроведениеДоговораАренды(Источник);
			КонецЕсли;
			
			ПровестиДолг(Источник, Стр);
			Источник.Движения.АР_РасчетыПоДоговорам.Записать(); // на случай если реализация засчитывает сама по себе оплату
				
		ИначеЕсли Стр.Тип = "Оплата" Тогда
				
			ПровестиОплату(Источник, Стр);
								
		КонецЕсли;
		
	КонецЦикла;
	
	Источник.Движения.АР_РасчетыПоДоговорам.Записать();
	
КонецПроцедуры

Процедура СторнироватьПроведениеДоговораАренды(Источник)
	
	РасчетыПоДоговорам = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Услуги.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	Услуги.Номенклатура КАК Номенклатура,
	               |	Услуги.Сумма + ВЫБОР
	               |		КОГДА НЕ Услуги.Ссылка.ТипЦен.ЦенаВключаетНДС
	               |			ТОГДА Услуги.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Сумма,
	               |	НАЧАЛОПЕРИОДА(Услуги.Ссылка.Дата, МЕСЯЦ) КАК Месяц
	               |ПОМЕСТИТЬ ВТ1
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
	               |ГДЕ
	               |	Услуги.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АгентскиеУслуги.Ссылка.ДоговорКонтрагента,
	               |	АгентскиеУслуги.Номенклатура,
	               |	АгентскиеУслуги.Сумма + ВЫБОР
	               |		КОГДА НЕ АгентскиеУслуги.Ссылка.ТипЦен.ЦенаВключаетНДС
	               |			ТОГДА АгентскиеУслуги.СуммаНДС
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	НАЧАЛОПЕРИОДА(АгентскиеУслуги.Ссылка.Дата, МЕСЯЦ)
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК АгентскиеУслуги
	               |ГДЕ
	               |	АгентскиеУслуги.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ1.Месяц КАК Месяц,
	               |	ВТ1.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ВТ1.Номенклатура КАК Номенклатура,
	               |	СУММА(ВТ1.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ1 КАК ВТ1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ1.Номенклатура,
	               |	ВТ1.ДоговорКонтрагента,
	               |	ВТ1.Месяц
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Рег.ДокументРасчетов КАК ДокументРасчетов,
	               |	Рег.ГруппаУслуг КАК ГруппаУслуг,
	               |	Рег.Номенклатура КАК Номенклатура,
	               |	ВТ2.Сумма КАК Сумма,
	               |	Рег.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(//&Период
				   |		, ТИПЗНАЧЕНИЯ(ДокументРасчетов) = ТИП(Документ.Ар17_ПроведениеДоговораАренды)) КАК Рег
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
	               |		ПО Рег.ДоговорКонтрагента = ВТ2.ДоговорКонтрагента
	               |			И Рег.Номенклатура = ВТ2.Номенклатура
	               |			И Рег.Месяц = ВТ2.Месяц";
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
					
		Нов						=	РасчетыПоДоговорам.Добавить();
		Нов.Период				=	Источник.Дата;
		Нов.Месяц				=	НачалоМесяца(Источник.Дата);
		Нов.ВидДвижения			=	ВидДвиженияНакопления.Расход;
		Нов.Организация			=	Источник.Организация;
		Нов.Контрагент			=	Источник.Контрагент;
		Нов.ДоговорКонтрагента	=	Источник.ДоговорКонтрагента;
		Нов.ДокументРасчетов	=	Рез.ДокументРасчетов;
		Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
		Нов.Номенклатура		=	Рез.Номенклатура;
		Нов.Сумма				=	?(Рез.Сумма > Рез.СуммаОстаток, Рез.СуммаОстаток, Рез.Сумма);
					
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьДанныеТаблиц(Запрос, Источник)
	
	МетаданныеИсточника = Источник.Метаданные();
	
	Если МетаданныеИсточника.Реквизиты.Найти("СуммаВключаетНДС") <> Неопределено И Источник.СуммаВключаетНДС Тогда
		Запрос.УстановитьПараметр("СуммаВключаетНДС", Истина);
	Иначе
		Запрос.УстановитьПараметр("СуммаВключаетНДС", Ложь);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ";
	
	ТЧ_Услуги = Неопределено;
	Если МетаданныеИсточника.ТабличныеЧасти.Найти("Услуги") <> Неопределено Тогда
		
		ТЧ_Услуги = Источник.Услуги.Выгрузить();
		
		Запрос.Текст = Запрос.Текст + "
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Сумма + 
		|	ВЫБОР КОГДА НЕ &СуммаВключаетНДС ТОГДА ТЧ.СуммаНДС ИНАЧЕ 0 КОНЕЦ";
		
		Если МетаданныеИсточника.ТабличныеЧасти.Услуги.Реквизиты.Найти("СуммаДоИзменения") <> Неопределено Тогда
			
			Запрос.Текст = Запрос.Текст + " -
			|	ТЧ.СуммаДоИзменения -
			|	ВЫБОР КОГДА НЕ &СуммаВключаетНДС ТОГДА ТЧ.СуммаНДСДоИзменения ИНАЧЕ 0 КОНЕЦ";
			
		КонецЕсли;
		
	Иначе		
		
		Запрос.Текст = Запрос.Текст + "
		|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
		|	0";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " КАК Сумма
	|ПОМЕСТИТЬ ТЧ_Услуги";
	
	Если ТЧ_Услуги <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("ТЧ_Услуги", ТЧ_Услуги);
		Запрос.Текст = Запрос.Текст + "
		|ИЗ &ТЧ_Услуги КАК ТЧ";
		
	КонецЕсли;
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ";
	
	ТЧ_АгентскиеУслуги = Неопределено;
	Если МетаданныеИсточника.ТабличныеЧасти.Найти("АгентскиеУслуги") <> Неопределено Тогда
		
		ТЧ_АгентскиеУслуги = Источник.АгентскиеУслуги.Выгрузить();
		
		Запрос.Текст = Запрос.Текст + "
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Сумма + 
		|	ВЫБОР КОГДА НЕ &СуммаВключаетНДС ТОГДА ТЧ.СуммаНДС ИНАЧЕ 0 КОНЕЦ";
		
		Если МетаданныеИсточника.ТабличныеЧасти.АгентскиеУслуги.Реквизиты.Найти("СуммаДоИзменения") <> Неопределено Тогда
			
			Запрос.Текст = Запрос.Текст + " -
			|	ТЧ.СуммаДоИзменения -
			|	ВЫБОР КОГДА НЕ &СуммаВключаетНДС ТОГДА ТЧ.СуммаНДСДоИзменения ИНАЧЕ 0 КОНЕЦ";
			
		КонецЕсли;
		
	Иначе		
		
		Запрос.Текст = Запрос.Текст + "
		|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
		|	0";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " КАК Сумма
	|ПОМЕСТИТЬ ТЧ_АгентскиеУслуги";
	
	Если ТЧ_АгентскиеУслуги <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("ТЧ_АгентскиеУслуги", ТЧ_АгентскиеУслуги);
		Запрос.Текст = Запрос.Текст + "
		|ИЗ &ТЧ_АгентскиеУслуги КАК ТЧ";
		
	КонецЕсли;
	Запрос.Выполнить();	
	
КонецПроцедуры

Процедура ПровестиДолг(Источник, Стр)
	
	РасчетыПоДоговорам = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Табл = ПолучитьДанныеЗДА(Стр.ДоговорКонтрагента);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПолучитьДанныеТаблиц(Запрос, Источник);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Номенклатура КАК Номенклатура,
	               |	ТЧ.Сумма КАК Сумма
	               |ПОМЕСТИТЬ ВТ1
	               |ИЗ
	               |	ТЧ_Услуги КАК ТЧ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТЧ.Номенклатура,
	               |	ТЧ.Сумма
	               |ИЗ
	               |	ТЧ_АгентскиеУслуги КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ1.Номенклатура КАК Номенклатура,
	               |	СУММА(ВТ1.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ1 КАК ВТ1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ1.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Табл.Услуга КАК Номенклатура,
	               |	Табл.ГруппаУслуг КАК ГруппаУслуг
	               |ПОМЕСТИТЬ ВТ3
	               |ИЗ
	               |	&Табл КАК Табл
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ2.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ3.ГруппаУслуг, ЗНАЧЕНИЕ(Справочник.Ар_ГруппыУслуг.БезГруппы)) КАК ГруппаУслуг,
	               |	ВТ2.Сумма КАК Сумма
	               |ИЗ
	               |	ВТ2 КАК ВТ2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ3 КАК ВТ3
	               |		ПО ВТ2.Номенклатура = ВТ3.Номенклатура
	               |ГДЕ
	               |	ВТ2.Сумма <> 0";
	Запрос.УстановитьПараметр("Табл", Табл);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	СуммаДолга = Стр.Сумма;
	
	Пока Рез.Следующий() Цикл
		
		Если СуммаДолга <> 0 Тогда
		
			Нов						=	РасчетыПоДоговорам.Добавить();
			Нов.Период				=	Источник.Дата;
			Нов.Месяц				=	НачалоМесяца(Стр.ДокументРасчета.Дата);
			Нов.ВидДвижения			=	ВидДвиженияНакопления.Приход;
			Нов.Организация			=	Источник.Организация;
			Нов.Контрагент			=	Стр.ДоговорКонтрагента.Владелец;
			Нов.ДоговорКонтрагента	=	Стр.ДоговорКонтрагента;
			Нов.ДокументРасчетов	=	Стр.ДокументРасчета;
			Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
			Нов.Номенклатура		=	Рез.Номенклатура;
			Нов.Сумма				=	?(Рез.Сумма < СуммаДолга, Рез.Сумма, СуммаДолга);
			
			СуммаДолга				=	СуммаДолга - Нов.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СуммаДолга <> 0 Тогда
		
		Нов						=	РасчетыПоДоговорам.Добавить();
		Нов.Период				=	Источник.Дата;
		Нов.Месяц				=	?(ЗначениеЗаполнено(Стр.ДокументРасчета), НачалоМесяца(Стр.ДокументРасчета.Дата), НачалоМесяца(Источник.Дата));
		Нов.ВидДвижения			=	ВидДвиженияНакопления.Приход;
		Нов.Организация			=	Стр.ДоговорКонтрагента.Организация;
		Нов.Контрагент			=	Стр.ДоговорКонтрагента.Владелец;
		Нов.ДоговорКонтрагента	=	Стр.ДоговорКонтрагента;
		Нов.ДокументРасчетов	=	Стр.ДокументРасчета;
		Нов.ГруппаУслуг			=	Справочники.АР_ГруппыУслуг.БезГруппы;
		Нов.Номенклатура		=	Справочники.Номенклатура.ПустаяСсылка();
		Нов.Сумма				=	СуммаДолга;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПровестиОплату(Источник, Стр)
	
	РасчетыПоДоговорам = Источник.Движения.АР_РасчетыПоДоговорам;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рег.ГруппаУслуг КАК ГруппаУслуг,
	               |	Рег.Номенклатура КАК Номенклатура,
	               |	Рег.СуммаОстаток КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.Остатки(&Период, ДокументРасчетов = &ДокументРасчетов) КАК Рег";
	Запрос.УстановитьПараметр("ДокументРасчетов", Стр.ДокументРасчета);
	Запрос.УстановитьПараметр("Период", Новый Граница(Источник.МоментВремени(), ВидГраницы.Включая));
	
	СуммаКСписанию = Стр.Сумма;
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		Если СуммаКСписанию > 0 Тогда
		
			Нов = РасчетыПоДоговорам.Добавить();
			Нов.Период				=	Источник.Дата;
			Нов.Месяц				=	?(ЗначениеЗаполнено(Стр.ДокументРасчета),НачалоМесяца(Стр.ДокументРасчета.Дата), НачалоМесяца(Источник.Дата));
			Нов.ВидДвижения			=	ВидДвиженияНакопления.Расход;
			Нов.Организация			=	Стр.ДоговорКонтрагента.Организация;
			Нов.Контрагент			=	Стр.ДоговорКонтрагента.Владелец;
			Нов.ДоговорКонтрагента	=	Стр.ДоговорКонтрагента;
			Нов.ДокументРасчетов	=	Стр.ДокументРасчета;
			Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
			Нов.Номенклатура		=	Рез.Номенклатура;
			Нов.Сумма				=	?(Рез.СуммаОстаток > СуммаКСписанию, СуммаКСписанию, Рез.СуммаОстаток);
			
			СуммаКСписанию			=	СуммаКСписанию - Нов.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Кусок говна который все согласовали
	Если СуммаКСписанию > 0 Тогда
		
		Нов = РасчетыПоДоговорам.Добавить();
		Нов.Период				=	Источник.Дата;
		Нов.Месяц				=	НачалоМесяца(Источник.Дата);
		Нов.ВидДвижения			=	ВидДвиженияНакопления.Расход;
		Нов.Организация			=	Стр.ДоговорКонтрагента.Организация;
		Нов.Контрагент			=	Стр.ДоговорКонтрагента.Владелец;
		Нов.ДоговорКонтрагента	=	Стр.ДоговорКонтрагента;
		Нов.ГруппаУслуг			=	Справочники.АР_ГруппыУслуг.БезГруппы;
		Нов.Номенклатура		=	Справочники.Номенклатура.ПустаяСсылка();
		Нов.Сумма				=	СуммаКСписанию;
		
		// + NAI Becar Комментирование Смирнов А.А. от 08.09.2022 14:35
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.С_РаспределениеАвансовНаПринципалов") Тогда
			Нов.ДокументРасчетов	=	Стр.ДокументРасчета;
		КонецЕсли;	
		// - NAI Becar Комментирование Смирнов А.А.
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СторноДолга(Источник, Договор, ДокументРасчета, Сумма)
	
	Запрос = Новый Запрос("Выбрать * Из РегистрНакопления.АР_РасчетыПоДоговорам КАК Рег Где Рег.Регистратор = &Реализация");
	Запрос.УстановитьПараметр("Реализация", ДокументРасчета);
	Рез = Запрос.Выполнить().Выбрать();
	
	СуммаКСтрорнированию = Сумма;
	
	Пока Рез.Следующий() Цикл
		
		Если СуммаКСтрорнированию > 0 Тогда
			
			Нов						=	Источник.Движения.Ар_РасчетыПоДоговорам.Добавить();
			Нов.ВидДвижения			=	ВидДвиженияНакопления.Приход;
			Нов.Период				=	Источник.Дата;
			Нов.Месяц				=	НачалоМесяца(ДокументРасчета.Дата);
			Нов.Организация			=	Договор.Организация;
			Нов.Контрагент			=	Договор.Владелец;
			Нов.ДоговорКонтрагента	=	Договор;
			Нов.ДокументРасчетов	=	ДокументРасчета;
			Нов.ГруппаУслуг			=	?(ЗначениеЗаполнено(Рез.ГруппаУслуг), Рез.ГруппаУслуг, Справочники.АР_ГруппыУслуг.БезГруппы);
			Нов.Номенклатура		=	Рез.Номенклатура;
			Нов.Сумма				=	- ?(Рез.Сумма > СуммаКСтрорнированию, СуммаКСтрорнированию, Рез.Сумма);
			
			СуммаКСтрорнированию	=	СуммаКСтрорнированию + Нов.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеЗДА(Договор)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Док.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды КАК Док
	                      |ГДЕ
	                      |	Док.Проведен
	                      |	И Док.ДоговорКонтрагента = &ДоговорКонтрагента
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧ.Ссылка КАК Ссылка,
	                      |	ТЧ.Услуга КАК Услуга,
	                      |	ТЧ.ГруппаУслуг КАК ГруппаУслуг
	                      |ПОМЕСТИТЬ Табл
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК ТЧ
	                      |ГДЕ
	                      |	ТЧ.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				Т.Ссылка
	                      |			ИЗ
	                      |				Вт КАК Т)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТЧ.Ссылка,
	                      |	ТЧ.Услуга,
	                      |	ТЧ.ГруппаУслуг
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК ТЧ
	                      |ГДЕ
	                      |	ТЧ.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				Т.Ссылка
	                      |			ИЗ
	                      |				Вт КАК Т)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТЧ.Ссылка,
	                      |	ТЧ.Услуга,
	                      |	ТЧ.ГруппаУслуг
	                      |ИЗ
	                      |	Документ.АР17_ЗаключениеДоговораАренды.КоммунальныеУслуги КАК ТЧ
	                      |ГДЕ
	                      |	ТЧ.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				Т.Ссылка
	                      |			ИЗ
	                      |				Вт КАК Т)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Т.Услуга КАК Услуга,
	                      |	Т.ГруппаУслуг КАК ГруппаУслуг,
	                      |	ЕСТЬNULL(Спр.Приоритет, 99999) КАК Приоритет,
	                      |	СУММА(0) КАК Остаток
	                      |ИЗ
	                      |	Табл КАК Т
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АР_ГруппыУслуг КАК Спр
	                      |		ПО Т.ГруппаУслуг = Спр.Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Т.Услуга,
	                      |	Т.ГруппаУслуг,
	                      |	ЕСТЬNULL(Спр.Приоритет, 99999)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Приоритет");
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Табл = Запрос.Выполнить().Выгрузить();
	
	Возврат Табл;
	
КонецФункции

Функция ПолучитьЗДА(Договор, КодСчета) Экспорт
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		
		Возврат Неопределено;
		
	ИначеЕсли Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СПокупателем И КодСчета <> "62.01" Тогда
		
		Возврат Неопределено;
		
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.Текст = "Выбрать Первые 1 Док.Ссылка Из Документ.АР17_ЗаключениеДоговораАренды КАК Док Где Док.ДоговорКонтрагента = &Договор";
		Запрос.УстановитьПараметр("Договор", Договор);
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда Возврат Рез.Ссылка;
		Иначе Возврат Неопределено КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДокументРасчета(Док)
	
	Если Не ЗначениеЗаполнено(Док) Тогда
		
		Возврат Неопределено;
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Возврат Док;
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") Тогда
		
		Возврат Док;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
